# Sujet Réseau et Infra

## I. Dumb switch 

### 3. Setup topologie 1

```
PC2> ip 10.5.1.2
Checking for duplicate address...
PC1 : 10.5.1.2 255.255.255.0

PC1> ip 10.5.1.1/24
Checking for duplicate address...
PC1 : 10.5.1.1 255.255.255.0

PC1> ping 10.5.1.2

84 bytes from 10.5.1.2 icmp_seq=1 ttl=64 time=1.204 ms
84 bytes from 10.5.1.2 icmp_seq=2 ttl=64 time=1.142 ms
^C
```

## II. VLAN

### 3. Setup topologie 2

####  Adressage

```
PC1> ip 10.5.10.1/24
Checking for duplicate address...
PC1 : 10.5.10.1 255.255.255.0

PC2> ip 10.5.10.2/24
Checking for duplicate address...
PC2 : 10.5.10.2 255.255.255.0

PC3> ip 10.5.10.3/24
Checking for duplicate address...
PC3 : 10.5.10.3 255.255.255.0

PC1> ping 10.5.10.2

84 bytes from 10.5.10.2 icmp_seq=1 ttl=64 time=0.822 ms
84 bytes from 10.5.10.2 icmp_seq=2 ttl=64 time=0.895 ms
84 bytes from 10.5.10.2 icmp_seq=3 ttl=64 time=1.004 ms
^C
PC2> ping 10.5.10.3

84 bytes from 10.5.10.3 icmp_seq=1 ttl=64 time=1.244 ms
84 bytes from 10.5.10.3 icmp_seq=2 ttl=64 time=1.380 ms
84 bytes from 10.5.10.3 icmp_seq=3 ttl=64 time=1.342 ms
^C
```
#### Configuration des VLANs

```
IOU1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU1(config)#vlan 10
IOU1(config-vlan)#name admins
IOU1(config-vlan)#exit
IOU1(config)#vlan 20
IOU1(config-vlan)#name guests
IOU1(config-vlan)#exit

IOU1(config)#interface Ethernet0/0
IOU1(config)#switchport mode access
IOU1(config)#switchport access vlan 10
IOU1(config)#exit
(pour les 3 ports)
```
#### Vérif
```
PC1> ping 10.5.10.2

84 bytes from 10.5.10.2 icmp_seq=1 ttl=64 time=0.983 ms
84 bytes from 10.5.10.2 icmp_seq=2 ttl=64 time=1.265 ms
^C
PC1> ping 10.5.10.3

host (10.5.10.3) not reachable
```
## III. Routing

####  Adressage

```
PC1> ip 10.5.10.1/24
Checking for duplicate address...
PC1 : 10.5.10.1 255.255.255.0

PC2> ip 10.5.10.2/24
Checking for duplicate address...
PC2 : 10.5.10.2 255.255.255.0

adm1> ip 10.5.20.1/24
Checking for duplicate address...
adm1 : 10.5.20.1 255.255.255.0

et sur la VM on as mis l'IP : 10.5.30.1/24 
```
#### Configuration des VLANs

```
IOU1#conf t
IOU1(config)#vlan 10
IOU1(config-vlan)#name clients
IOU1(config-vlan)#exit
IOU1(config)#vlan 20
IOU1(config-vlan)#name admins
IOU1(config-vlan)#exit
IOU1(config)#vlan 30
IOU1(config-vlan)#name servers
IOU1(config-vlan)#exit
IOU1(config-if)#interface Ethernet0/0
IOU1(config-if)#interface Ethernet0/1
IOU1(config-if)# switchport mode access
IOU1(config-if)#switchport access vlan 10
IOU1(config-if)#exit
IOU1(config)#interface Ethernet0/2
IOU1(config-if)#switchport mode access
IOU1(config-if)#switchport access vlan 20
IOU1(config-if)#exit
IOU1(config)#interface Ethernet0/3
IOU1(config-if)#switchport mode access
IOU1(config-if)#switchport access vlan 30
IOU1(config-if)#exit
IOU1# conf t
IOU1(config)# interface fastEthernet1/0
IOU1(config-if)# switchport trunk encapsulation dot1q
IOU1(config-if)# switchport mode trunk
IOU1(config-if)# switchport trunk allowed vlan add 10,20,30
IOU1(config-if)# exit
IOU1(config)# exit

```
```
IOU1#show vlan br

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et1/1, Et1/2, Et1/3, Et2/0
                                                Et2/1, Et2/2, Et2/3, Et3/0
                                                Et3/1, Et3/2, Et3/3
10   clients                          active    Et0/0, Et0/1
20   admins                           active    Et0/2
30   servers                          active    Et0/3
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
IOU1#show interface trunk

Port        Mode             Encapsulation  Status        Native vlan
Et1/0       on               802.1q         trunking      1

Port        Vlans allowed on trunk
Et1/0       1-4094

Port        Vlans allowed and active in management domain
Et1/0       1,10,20,30

Port        Vlans in spanning tree forwarding state and not pruned
Et1/0       1,10,20,30

```
#### Config du routeur

```
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface fastEthernet 0/0.10
R1(config-subif)#encapsulation dot1Q 10
R1(config-subif)#ip addr 10.5.10.254 255.255.255.0
R1(config-subif)#exit
R1(config)#interface fastEthernet 0/0.20
R1(config-subif)#encapsulation dot1Q 20
R1(config-subif)#ip addr 10.5.20.254 255.255.255.0
R1(config-subif)#exit
R1(config)#interface fastEthernet 0/0.30
R1(config-subif)#encapsulation dot1Q 30
R1(config-subif)#ip addr 10.5.30.254 255.255.255.0
R1(config-subif)#exit
```

#### Verif
ajout des routes par default 

```
PC1> ip 10.5.10.1/10.5.10.254
Checking for duplicate address...
PC1 : 10.5.10.1 255.255.255.0 gateway 10.5.10.254

PC2> ip 10.5.10.2/10.5.10.254
Checking for duplicate address...
PC2 : 10.5.10.2 255.255.255.0 gateway 10.5.10.254

adm1> ip 10.5.20.1/10.5.20.254
Checking for duplicate address...
adm1 : 10.5.20.1 255.255.255.0 gateway 10.5.20.254
```




```
R1#conf t
R1(config)#interface fastEthernet 0/0
R1(config-if)#duplex full
R1(config-if)#exit
R1(config)#exit

IOU1#conf t
IOU1(config)#interface Ethernet 1/0
IOU1(config-if)#duplex full
IOU1(config-if)#exit
IOU1(config)#exit

R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface fastEthernet0/0
R1(config-if)#no shut
R1(config-if)#
*Mar  1 01:45:13.503: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 01:45:14.507: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R1(config-if)#exit
R1(config)#exit

PC1> ping 10.5.10.2

84 bytes from 10.5.10.2 icmp_seq=1 ttl=64 time=0.373 ms
84 bytes from 10.5.10.2 icmp_seq=2 ttl=64 time=0.675 ms
^C
PC1> ping 10.5.20.1

84 bytes from 10.5.20.1 icmp_seq=3 ttl=63 time=15.128 ms
84 bytes from 10.5.20.1 icmp_seq=4 ttl=63 time=27.826 ms
^C

PC1>ping 10.5.30.1

84 bytes from 10.5.30.1 icmp_seq=2 ttl=63 time=15.131 ms
84 bytes from 10.5.30.1 icmp_seq=3 ttl=63 time=18.974 ms
84 bytes from 10.5.30.1 icmp_seq=4 ttl=63 time=14.281 ms
^C

adm1> ping 10.5.30.1

84 bytes from 10.5.30.1 icmp_seq=1 ttl=63 time=19.573 ms
84 bytes from 10.5.30.1 icmp_seq=2 ttl=63 time=14.884 ms
^C
```

## IV. NAT
### 3. Setup topologie 4
#### Ajoutez le noeud Cloud à la topo
```
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface fastEthernet 0/1
1(config-if)#ip address dhcp
R1(config-if)#no shut
R1(config-if)#
*Mar  1 01:56:09.291: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Mar  1 01:56:10.291: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
R1(config-if)#exit
R1(config)#exit

PC1> ping 1.1.1.1

84 bytes from 1.1.1.1 icmp_seq=2 ttl=55 time=38.331 ms
84 bytes from 1.1.1.1 icmp_seq=3 ttl=55 time=24.029 ms
^C
```
####  Configurez le NAT

```
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface fastEthernet0/0
R1(config-if)#ip nat outside
R1(config-if)#exit
R1(config)#access-list 1 permit any
R1(config)#ip nat inside source list 1 interface fastEthernet 0/0 overload
R1(config)#
```

#### Configurez le NAT

```
PC1> ip dns 1.1.1.1

PC1> ping google.com
google.com resolved to 216.58.214.78

84 bytes from 216.58.214.78 icmp_seq=1 ttl=115 time=29.819 ms
84 bytes from 216.58.214.78 icmp_seq=2 ttl=115 time=26.892 ms
^C
```
